app/controllers/resources_controller.rb

  def index
    @resources = Resource.all
---
SELECT "resources".* FROM "resources"  ORDER BY :precovenda1

  def show
    @webcontents = Webcontent.where(url_id: @resource.id)
---
SELECT  "webcontents".* FROM "webcontents" WHERE "webcontents"."url_id" = ? LIMIT 1  [["url_id", 4]]

  def create
    @resource = Resource.new(resource_params)

    if @resource.save
      parse_store_content(@resource.id, @resource.url)

      @webcontents = Webcontent.where(url_id: @resource.id)
---
INSERT INTO "resources" ("codproduto", "descricao1", "precovenda1", "aplicacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["codproduto", "x"], ["descricao1", "x"], ["precovenda1", 3], ["aplicacao", "xx"], ["created_at", "2016-09-07 19:12:52.682620"], ["updated_at", "2016-09-07 19:12:52.682620"]]
SELECT "webcontents".* FROM "webcontents" WHERE "webcontents"."url_id" = ?  [["url_id", 15]]

  def update
    if @resource.update(resource_params)
---
UPDATE "resources" SET "descricao1" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["descricao1", "Era uma vezsss"], ["updated_at", "2015-07-29 12:16:14.084617"], ["id", 1]]

  def destroy
    @resource.destroy
---
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 2]]

    def set_resource
      @resource = Resource.find(params[:id])
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", 2]]